export type RegionCode = "west" | "east" | "north" | "center" | "south";

export interface RegionDef {
    code: RegionCode;
    label: string;
    cities: string[];
}

export const REGIONS: RegionDef[] = [
    {
        code: "west",
        label: "Запад",
        cities: [
            "Актау",
            "Жанаозен",
            "Бейнеу",
            "Атырау",
            "Кулсары",
            "Уральск",
            "Аксай",
            "Актобе",
            "Хромтау",
        ],
    },
    {
        code: "east",
        label: "Восток",
        cities: [
            "Усть-Каменогорск",
            "Семей",
            "Риддер",
            "Зыряновск",
            "Шемонаиха",
            "Аягоз",
            "Зайсан",
        ],
    },
    {
        code: "north",
        label: "Север",
        cities: [
            "Астана",
            "Кокшетау",
            "Степногорск",
            "Макинск",
            "Щучинск",
            "Косшы",
            "Аркалык",
            "Костанай",
            "Рудный",
            "Житикара",
            "Петропавловск",
            "Павлодар",
            "Аксу",
            "Экибастуз",
        ],
    },
    {
        code: "center",
        label: "Центр",
        cities: [
            "Караганда",
            "Темиртау",
            "Сарань",
            "Шахтинск",
            "Соран",
            "Балхаш",
            "Жезказган",
            "Сатпаев",
            "Жанарка",
        ],
    },
    {
        code: "south",
        label: "Юг",
        cities: [
            "Алматы",
            "Кунаев",
            "Капчагай",
            "Капшагай",
            "Талгар",
            "Каскелен",
            "Есик",
            "Талдыкорган",
            "Жетысай",
            "Уштобе",
            "Жаркент",
            "Сарыкемер",
            "Тараз",
            "Шу",
            "Карабулак",
            "Шымкент",
            "Туркестан",
            "Кентау",
            "Сайрам",
            "Сарыагаш",
            "Арыс",
            "Чунджа",
            "Кызылорда",
            "Шиели",
            "Байконур",
        ],
    },
];
